balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F66J60.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MAADR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MAADR6" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAADR6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="MAADR6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MAADR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MAADR3" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAADR3" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="MAADR3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MAADR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MAADR4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAADR4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="MAADR4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MAADR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MAADR1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAADR1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="MAADR1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MAADR2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MAADR2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAADR2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="MAADR2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="----rrrr" edc:cname="MISTAT" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="MISTAT" edc:nzwidth="0x8" edc:por="----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCAN" edc:desc="" edc:mask="0x1" edc:name="SCAN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVALID" edc:desc="" edc:mask="0x1" edc:name="NVALID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LINKFL" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="LINKFL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="-----rnn" edc:cname="EFLOCON" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="EFLOCON" edc:nzwidth="0x8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FCEN0" edc:desc="" edc:mask="0x1" edc:name="FCEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FCEN1" edc:desc="" edc:mask="0x1" edc:name="FCEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FULDPXS" edc:desc="" edc:mask="0x1" edc:name="FULDPXS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="EPAUS" edc:desc="" edc:name="EPAUS" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EPAUSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EPAUSL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EPAUSL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EPAUSL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EPAUSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010000" edc:name="EPAUSH" edc:nzwidth="0x8" edc:por="00010000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EPAUSH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EPAUSH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="MACON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="MACON1" edc:nzwidth="0x8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MARXEN" edc:desc="" edc:mask="0x1" edc:name="MARXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PASSALL" edc:desc="" edc:mask="0x1" edc:name="PASSALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXPAUS" edc:desc="" edc:mask="0x1" edc:name="RXPAUS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPAUS" edc:desc="" edc:mask="0x1" edc:name="TXPAUS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MACON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MACON3" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FULDPX" edc:desc="" edc:mask="0x1" edc:name="FULDPX" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRMLNEN" edc:desc="" edc:mask="0x1" edc:name="FRMLNEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HFRMEN" edc:desc="" edc:mask="0x1" edc:name="HFRMEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHDREN" edc:desc="" edc:mask="0x1" edc:name="PHDREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCRCEN" edc:desc="" edc:mask="0x1" edc:name="TXCRCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PADCFG0" edc:desc="" edc:mask="0x1" edc:name="PADCFG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PADCFG1" edc:desc="" edc:mask="0x1" edc:name="PADCFG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PADCFG2" edc:desc="" edc:mask="0x1" edc:name="PADCFG2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PADCFG" edc:desc="" edc:mask="0x7" edc:name="PADCFG" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn----" edc:cname="MACON4" edc:desc="" edc:impl="0x70" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="MACON4" edc:nzwidth="0x8" edc:por="-000--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="NOBKOFF" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="NOBKOFF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BPEN" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="BPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DEFER" edc:desc="" edc:mask="0x1" edc:name="DEFER" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="MABBIPG" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="MABBIPG" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BBIPG0" edc:desc="" edc:mask="0x1" edc:name="BBIPG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BBIPG1" edc:desc="" edc:mask="0x1" edc:name="BBIPG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BBIPG2" edc:desc="" edc:mask="0x1" edc:name="BBIPG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BBIPG3" edc:desc="" edc:mask="0x1" edc:name="BBIPG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BBIPG4" edc:desc="" edc:mask="0x1" edc:name="BBIPG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BBIPG5" edc:desc="" edc:mask="0x1" edc:name="BBIPG5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BBIPG6" edc:desc="" edc:mask="0x1" edc:name="BBIPG6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:JoinedSFRDef edc:cname="MAIPG" edc:desc="" edc:name="MAIPG" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="-nnnnnnn" edc:cname="MAIPGL" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="MAIPGL" edc:nzwidth="0x8" edc:por="-0000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MAIPGL" edc:desc="" edc:islanghidden="true" edc:mask="0x7f" edc:name="MAIPGL" edc:nzwidth="0x7"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
